{"id":10846540,"title":"Magic+","points":256,"user":"calvin_c","time":1452032636,"time_ago":"4 hours ago","type":"link","url":"https://getmagicnow.com/plus","domain":"getmagicnow.com","comments":[{"id":10847160,"level":0,"user":"paul","time":1452037975,"time_ago":"2 hours ago","content":"<p>A lot of skepticism here, which is understandable given the somewhat unbelievable scope of what they are promising.<p>I&#x27;m a very active user of Magic+, so I&#x27;ll give my perspective. (and of course I&#x27;ve been working with them from the beginning at YC, so you&#x27;re also free to discard my opinion as biased)<p>For me, Magic+ is basically the impossibly good personal assistant, kind of like Jarvis in Iron Man, or Emily in The Devil Wears Prada. Unlike a conventional assistant, it&#x27;s available 24&#x2F;7, always happy to take on more work, and capable of accomplishing just about anything.<p>Obviously the $100&#x2F;hr price point puts it out of reach for most people, but my expectation (as an investor) is that as the tech improves, they will be able to bring down the price while maintaining or even improving the quality of the service (I call this the Tesla strategy).<p>For me however, $100&#x2F;hr is totally worth it since it effectively increases my leverage and enables me to get more done in less time. I&#x27;ve used it to plan events for YC founders, answer questions that are hard to Google (they will find the right experts and ask them), and provide unique and memorable gifts to friends, family, and business partners. I&#x27;m used to paying a high price for quality professional services such as accountants or lawyers, so $100&#x2F;hr for the best possible assistant feels completely reasonable and rational.","comments":[{"id":10847638,"level":1,"user":"rtpg","time":1452042758,"time_ago":"an hour ago","content":"<p>&gt;but my expectation (as an investor) is that as the tech improves they will be able to bring down the price while maintaining or even improving the quality of the service<p>Call me skeptical, but where exactly is the tech involved? Currently this is just text messages going to people + people doing the things.<p>One possibility would be through AI (a bit of a weasel word most of the time, honestly), but Google and Apple are both miles ahead on NLP, so by the time you can parse &quot;get me a peperonni pizza&quot;, Google will have been doing it for free for the past year , and include a 10% off coupon for the pizza!<p>Considering your value is based almost entirely on getting things done through an assistant that understands English, it looks like costs are basically how much you pay the assistant themselves... Maybe you can get away with paying them $20&#x2F;hour (and equipping them with good tools to do the common stuff fast).<p>The Tesla strategy works (well, in theory) because so much of the cost of the good is based in things that are continuously getting cheaper (batteries).<p>But here... What&#x27;s driving down the cost of the assistants? Seems like the solutions are much more about HR-style &quot;innovations&quot; , business partnerships, and the like than anything coming out of MIT.<p>I sincerely hope the strategy isn&#x27;t &quot;find the cheapest human labor possible&quot;","comments":[{"id":10847750,"level":2,"user":"jfoutz","time":1452043927,"time_ago":"44 minutes ago","content":"<p>People are fairly predictable. Presumably they&#x27;ll build software to handle common requests quickly. Google pizza is a good example, but i doubt google will do pizza, dry cleaning, and travel booking all in one shot. (but they might). It seems like these folks can find a local vendor for service X, have a button on some internal software to send it out, then just leverage that for all customers in that city. presumably the oddball requests get tracked similarly. &quot;i want an elephant&quot; might take a while the first time, but the software should remember contacts and whatnot to make it easy if they ever get the same request.","comments":[{"id":10847798,"level":3,"user":"simoncion","time":1452044367,"time_ago":"37 minutes ago","content":"<p>&gt; Presumably they&#x27;ll build software to handle common requests quickly.<p>I&#x27;m not the OP, but...<p>I guess, but again, where&#x27;s the software? You can entirely reasonably solve that problem with a well-indexed medium-sized binder and a Rolodex.","comments":[{"id":10847839,"level":4,"user":"bonobo3000","time":1452044818,"time_ago":"29 minutes ago","content":"<p>It might not be necessary but it does help scale cheaply. You could have people pick up the phone and order food for you when requested, but if they can route that through an API 99% of the time it costs a whole lot less time &amp; money.","comments":[]}]}]},{"id":10847742,"level":2,"user":"seanlinehan","time":1452043838,"time_ago":"an hour ago","content":"<p>You don&#x27;t have to automate the parsing of queries to produce leverage here. Every time they answer a query successfully, I would imagine they add that to an internal repository of information. So the technology play would be less on the &quot;figure out what they want&quot; front and more on the &quot;deliver exactly what they want&quot; front.<p>Need an on demand helicopter in NYC? Great, Magic knows just who to call for that because they already did it for Justin Kan. Need to rent the Exploratorium? Great, they can do that too.<p>For more common requests that fit neatly into other on-demand services offering, they could ostensibly partner directly with those folks and integrate with them. That way, Magic could have their own master dashboard to purchase services with minimal effort.","comments":[{"id":10847880,"level":3,"user":"rtpg","time":1452045562,"time_ago":"17 minutes ago","content":"<p>that isn&#x27;t technology though, you just might use technology to keep track of it (wiki&#x2F;whatever). Maybe that&#x27;s what paul meant by &quot;technology&quot; but that isn&#x27;t a Tesla play by any stretch of the imagination.","comments":[]}]},{"id":10847699,"level":2,"user":"iLoch","time":1452043443,"time_ago":"an hour ago","content":"<p>AI is the obvious future for this yeah. I think the tech right now probably just centralizes around building really good customer profiles and excellent tools for assistants so that any assistant can pick up work for any customer.","comments":[]},{"id":10847646,"level":2,"user":"meowface","time":1452042870,"time_ago":"an hour ago","content":"<p>It&#x27;s an interesting idea, but I agree, I don&#x27;t see how it&#x27;s a tech company in any way.","comments":[]}]},{"id":10847855,"level":1,"user":"awakeasleep","time":1452045154,"time_ago":"23 minutes ago","content":"<p>I don&#x27;t think they would want to bring down the price.<p>Right now Magic is targeting price insensitive users, which provides an ENORMOUS advantage because they can always pick the most expensive options when executing a request. They basically remove one of the variables regular people have to optimize for, and it makes it much easier to make users happy.<p>If they&#x27;re dropping the price to where price-sensitive users get involved, they&#x27;re going to have to make far more complicated decisions about what flowers at what price point make someone happy, or what seat on what airline makes sense.","comments":[]},{"id":10847766,"level":1,"user":"onethumb","time":1452044058,"time_ago":"42 minutes ago","content":"<p>Hey Paul, this value proposition resonates with me (especially the comparison with lawyers and accountants) and I&#x27;m the target customer...  But I enthusiastically tried Magic when they first launched and it was full of fail (big promise from Magic, no delivery on a keg of beer from the East Bay).  I certainly would have paid a lot for it.  Skeptical that it&#x27;d be any different this time around? [Edit: typo]","comments":[]},{"id":10847253,"level":1,"user":"rootedbox","time":1452038988,"time_ago":"2 hours ago","content":"<p>Wouldn&#x27;t it be more price effective for you to hire a personal assistant; through one of your companies?","comments":[{"id":10847276,"level":2,"user":"paul","time":1452039228,"time_ago":"2 hours ago","content":"<p>I actually have a personal assistant, but for many tasks, Magic+ is simply better (and completely responsive 24&#x2F;7, which I would never demand of an employee).","comments":[{"id":10847956,"level":3,"user":"tempestn","time":1452046525,"time_ago":"a few seconds ago","content":"<p>Can you give some specific examples of things that Magic+ does better than a local personal assistant, besides being available around the clock?","comments":[]}]},{"id":10847381,"level":2,"user":"petke","time":1452040730,"time_ago":"2 hours ago","content":"<p>I never heard of this before but it sounds it scales better to big and small jobs, and is more efficient use of available manpower.<p>Say you have a huge job, or many small jobs, that one personal assistant couldn&#x27;t do at once alone. Or if you don&#x27;t have enough jobs at all times of the day to keep your personal assistant busy. etc..<p>Its kindof analogous to renting time on a server farm vs  owning a pc.","comments":[]}]},{"id":10847422,"level":1,"user":"mathgeek","time":1452041170,"time_ago":"an hour ago","content":"<p>Sounds like this is the epitome of &quot;you get what you pay for.&quot;","comments":[]},{"id":10847740,"level":1,"user":"beachstartup","time":1452043830,"time_ago":"an hour ago","content":"<p><i>&gt; Obviously the $100&#x2F;hr price point puts it out of reach for most people</i><p>$100&#x2F;hr for competent assistants 24&#x2F;7&#x2F;anywhere is a steal for any kind of organization like investment banks, enterprise sales, consulting firms, that send their people into the field to do high pressure, deadline-driven work.","comments":[]},{"id":10847482,"level":1,"user":"downandout","time":1452041587,"time_ago":"an hour ago","content":"<p>As an investor, could you explain the rationale behind there not being a tappable SMS link on the home page of a company that is wholly dependent on customers sending it SMS messages?","comments":[]}]},{"id":10846803,"level":0,"user":"joslin01","time":1452034886,"time_ago":"3 hours ago","content":"<p>Looks like the reception isn&#x27;t doing too well. I remember when Magic launched here on HN and it BLEW up. I was one of the people who tried it out. I live in NYC and actually had a poor experience.<p>The first two times, I said &quot;hey I want a sandwich with [x]&quot; and I got it but it took a lot longer than if I just clicked the necessary buttons on Seamless. Then I kept getting random calls from time to time from pizza delivery men saying they were downstairs.<p>They were very apologetic and nice about it, but really it just wasn&#x27;t worth it for me. The CTO (I think) reached out to me some months later asking why I stopped and well it&#x27;s the same answer: very little utility for someone like myself. If I were rich, hey sure why not boss someone around for random things (though I don&#x27;t know why I wouldn&#x27;t just hire someone I can trust). However, if you&#x27;re middle income or even a little higher, what&#x27;s the point really? Everything else is basically on-demand in this new uber-fied world.","comments":[{"id":10847468,"level":1,"user":"cdata","time":1452041511,"time_ago":"an hour ago","content":"<p>I had a very similar outcome with Magic after trying really hard to rely on it. One of their suggested usages is to order flowers for someone, so I tried that on two different occasions.<p>The first time around, I asked for flowers, and got a picture of some flowers that they could send to my recipient. I didn&#x27;t like the flowers in the picture, and so they picked another set of flowers per some feedback from me. The flowers arrived, and the recipient was touched, but my lingering feeling was that I would have spent the same amount of time ordering online, and it would have been easier to find the right kind of flowers if I had done so.<p>The second time I tried to order flowers was a complete disaster. I was ordering them for a special occasion, and Magic had told me they would be delivered within an acceptable time frame. However, the flowers never showed up. I was not notified that they had not showed up - instead I learned that they had not showed up after one of the more embarasing birthday calls of my life. Magic was very nice about it, refunded me and delivered the flowers late for free. The error may not even have been their fault. However, the extra layer of abstraction between me and the flower delivery person in this case seemed to make the whole situation worse.<p>I use a lot of different do-things-for-you services these days. In theory Magic is a service I should be totally hooked on, but these bad experiences killed it for me. What&#x27;s the point of a service that does everything for you if it makes things more complicated or harder to get done?","comments":[{"id":10847784,"level":2,"time":1452044247,"time_ago":"39 minutes ago","content":"[deleted]","deleted":true,"comments":[]}]},{"id":10847023,"level":1,"user":"cmikec","time":1452036658,"time_ago":"3 hours ago","content":"<p>I&#x27;m really sorry that your initial experience with Magic last year wasn&#x27;t ideal. We have come a long way since those initial days. Believe it or not, we actually did not plan that original launch -- rather, we released the website and number to a few people and it went viral practically overnight. We set up a waitlist as quickly as we could, but there definitely were some people in the beginning who did not have a good user experience. I hope that if you asked for a refund back then because you were dissatisfied, that you got one. If you didn&#x27;t, please feel free to text in now and claim it.<p>Some of the themes you&#x27;re bringing up here actually point to why we created Magic+ in the first place. Magic+ was developed as a response to the needs of the most active and demanding users of our standard Magic service. In particular, a common demand was to hold a very high bar for quality and seamlessness of experience.<p>Right now, some of these user-requested experiences are more expensive to deliver than the original Magic pricing model accounted for. Our plan is to offer Magic+ at this price now, because there is good demand for it at this price, and drop the price over time to reach a larger and larger market. $100 dollars an hour is a lot, but our most active users tell us that for this level of elite service, it&#x27;s a bargain.","comments":[{"id":10847202,"level":2,"user":"newman314","time":1452038385,"time_ago":"2 hours ago","content":"<p>I just noticed something strange in the screenshot. It seems to imply that Magic will work over iMessage. As far as I know, there is no publicly available API for iMessage so I&#x27;d be curious to know how this works.","comments":[{"id":10847867,"level":3,"user":"rahimnathwani","time":1452045380,"time_ago":"20 minutes ago","content":"<p>If they were using a regular phone number, they could achieve this by using the Messages app on iOS, and controlling it with AppleScript.","comments":[]},{"id":10847788,"level":3,"user":"nier","time":1452044275,"time_ago":"38 minutes ago","content":"<p>Setting up a Mac to programmatically send iMessages is trivial. I have a custom solution running that receives data over HTTPS and runs an AppleScript to send the specified text to the desired number or address via the Messages app using an iCloud account not tied to any mobile phone number.","comments":[]},{"id":10847350,"level":3,"user":"dennisnedry","time":1452040267,"time_ago":"2 hours ago","content":"<p>It&#x27;s an SMS, not specific to iMessage.","comments":[{"id":10847694,"level":4,"user":"Reedx","time":1452043364,"time_ago":"an hour ago","content":"<p>Then the messages would be green. I&#x27;m curious about this as well (unless they&#x27;re just photoshopped).<p>When I was experimenting with Twilio that was the only aspect that was a little disappointing. I wanted blue messages. :)","comments":[{"id":10847935,"level":5,"user":"firloop","time":1452046296,"time_ago":"4 minutes ago","content":"<p>Pretty sure they&#x27;re just photoshopped and they don&#x27;t use iMessage in reality. The font&#x2F;kerning&#x2F;size&#x2F;alignment looks off from here.","comments":[]}]},{"id":10847469,"level":4,"user":"asadm","time":1452041520,"time_ago":"an hour ago","content":"<p>the blue message bubble is iMessage specific.","comments":[{"id":10847679,"level":5,"user":"iancarroll","time":1452043171,"time_ago":"an hour ago","content":"<p>It&#x27;s evidently photoshopped, based on the message bubble padding. Definitely just an error.","comments":[]}]}]},{"id":10847281,"level":3,"time":1452039305,"time_ago":"2 hours ago","content":"[deleted]","deleted":true,"comments":[]}]}]},{"id":10846942,"level":1,"user":"Mahn","time":1452036001,"time_ago":"3 hours ago","content":"<p>&gt; If I were rich, hey sure why not boss someone around for random things (though I don&#x27;t know why I wouldn&#x27;t just hire someone I can trust). However, if you&#x27;re middle income or even a little higher, what&#x27;s the point really? Everything else is basically on-demand in this new uber-fied world.<p>Judging by the price and the copy in the page, I wouldn&#x27;t be surprised if it&#x27;s actually targeted at rich people.","comments":[{"id":10846962,"level":2,"user":"joslin01","time":1452036143,"time_ago":"3 hours ago","content":"<p>Yes - plus appears to be targeted at rich people (&quot;I need to have 6 convertibles by tomorrow&quot;). But remove that trailing `&#x2F;plus` at the end of the URL and you have their base product Magic, which isn&#x27;t.","comments":[]}]}]},{"id":10846992,"level":0,"user":"jcrites","time":1452036391,"time_ago":"3 hours ago","content":"<p>I use Magic and they provide incredible service. They&#x27;ve been able to accomplish pretty much everything I&#x27;ve asked, including some requests that I thought were borderline outlandish, such as having food from a restaurant across the country sent to me via chilled overnight air mail for a friend&#x27;s birthday as a big flashy surprise (friend&#x27;s favorite restaurant).<p>If you value your time more than your money, then they&#x27;re an excellent service that gives you a new suite of capabilities for making that tradeoff. They have been able to arrange everything I&#x27;ve asked them to do. What I like about them is that I can make a request without having any idea how to go about getting it fulfilled, and Magic will figure out how - they&#x27;ll do the research and find a solution. They are familiar with service providers for all sorts of unusual tasks and will set them up for you: personal chefs, car servicing pickup, garbage pickup - for everything I&#x27;ve asked they&#x27;ve had an answer.<p>They are primarily limited however by their staff on the ground or lack thereof. Although they&#x27;ve been able to organize couriers in several cities to accomplish tasks, they have occasionally been unable to find couriers on the day of a request. Magic is a generalist service: they can do virtually anything, but not necessarily within the same hour you ask. They&#x27;re worse than specialist services like Postmates at tasks like basic food pickup and delivery (mostly due to lower availability of couriers). Magic is most useful when your need is unusual and a typical service won&#x27;t be able to get it done - or when you want a complex problem to be solved and don&#x27;t want to have to think about or manage the solution. At such a task, they excel, and they&#x27;ve always come through for me in the end.<p>The Magic staff are very friendly and personable, as well. Their customer service is a tier above any other company I&#x27;ve interacted with. They handle requests with unusually high intellectual and emotional intelligence, and care. (Disclaimer: I haven&#x27;t used Magic+, only the original Magic which has been surprisingly cheap for the value it adds.)","comments":[{"id":10847601,"level":1,"user":"Archio","time":1452042451,"time_ago":"an hour ago","content":"<p>&gt; such as having food from a restaurant across the country sent to me via chilled overnight air mail for a friend&#x27;s birthday as a big flashy surprise<p>Maybe I&#x27;m missing something here, but this is making me seriously think about what Magic&#x27;s target market is. What kind of income would a person need to fathom affording something like that? I know people who I would consider &quot;wealthy&quot; on a first-world scale but this seems like a service suited for millionaires only (not that there is anything wrong with that, of course).","comments":[{"id":10847796,"level":2,"user":"mbrameld","time":1452044360,"time_ago":"37 minutes ago","content":"<p>You wouldn&#x27;t need an extravagant income to do something like that. I just did a quick check and it costs less than $150 to overnight an 8lb package from NY to SF with 8am delivery. So the markup over just buying the meal at the restaurant is going to be less than $300 once you add refrigerated packaging and pay somebody to order it, pick it up, package it, and ship it. That&#x27;s pricey if you&#x27;re doing it every week, but for a special occasion that&#x27;s not unimaginable for somebody even at the low end of middle class.","comments":[{"id":10847885,"level":3,"user":"njharman","time":1452045614,"time_ago":"16 minutes ago","content":"<p>I think most middle class people would think $300+ for a meal is wildly extravagant. And would think a $300 gift for &quot;a friend&quot; is on high end of gifts.","comments":[]}]},{"id":10847734,"level":2,"user":"patio11","time":1452043805,"time_ago":"an hour ago","content":"<p><i>What kind of income would a person need to fathom affording something like that?</i><p>What kind of income do you need to spend $200 on a Valentine&#x27;s dinner?  Probably not $1k a month.  It&#x27;s a stretch at $2k but not impossible.  It does not feel &quot;absurdly not socially normative&quot; at $3k -- I did it when I was a young twenty-something.<p>To the extent that there is a real class-based difference here, it may be &quot;degree of comfort with the notion that &#x27;there is probably a way to spend money to achieve this without needing to do anything else.&#x27;&quot;  It&#x27;s like, I don&#x27;t know, a bureaucratic process which requires someone to go down to City Hall and stand in line for half a day.  The middle class is capable of buying their way around that but it doesn&#x27;t generally occur to them to try; the upper class don&#x27;t even hear that that was a requirement because the very expensive person they use to handle legal issues already subcontracted it out.","comments":[{"id":10847778,"level":3,"user":"Archio","time":1452044158,"time_ago":"40 minutes ago","content":"<p>Yeah, but wouldn&#x27;t it be a lot more than $200? We&#x27;re talking Magic&#x27;s $100, however much the meal cost, plus the cost <i>chilled</i> overnight mail would be insane.","comments":[{"id":10847805,"level":4,"user":"mbrameld","time":1452044455,"time_ago":"35 minutes ago","content":"<p>They don&#x27;t chill the whole logistics chain, they just put the food in an insulated box with some dry ice and send it with the rest of the overnight packages.","comments":[{"id":10847822,"level":5,"user":"patio11","time":1452044615,"time_ago":"32 minutes ago","content":"<p>Yep -- see <a href=\"http:&#x2F;&#x2F;orderboxesnow.com&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;orderboxesnow.com&#x2F;</a> for FedEx&#x27;s first-party options, which are the upper bound on expense (for the chilling, not the overnight delivery).","comments":[]}]}]},{"id":10847789,"level":3,"user":"ceejayoz","time":1452044290,"time_ago":"38 minutes ago","content":"<p>&gt; What kind of income do you need to spend $200 on a Valentine&#x27;s dinner?<p>Ordering dinner from across the country overnight isn&#x27;t spending $200 on a Valentine&#x27;s dinner, though, it&#x27;s spending $200 on <i>leftovers</i>.","comments":[]}]},{"id":10847762,"level":2,"user":"aidenn0","time":1452044030,"time_ago":"42 minutes ago","content":"<p>I do somewhat extravagant things like this for my wife every anniversary divisible by 5 years; I&#x27;ve not used magic to do it, but most nice restaurants can make something like this happen if you call and ask.<p>It ends up being something a few times more expensive as a night out at the restaurant, so it&#x27;s not cheap, and you don&#x27;t get the ambiance, but my wife is very attached to memories, so the touch of &quot;somewhere we visited on a romantic trip&quot; is quite nice, and more appreciated than e.g. jewelry that might be as or more expensive.","comments":[]},{"id":10847802,"level":2,"user":"JoshTriplett","time":1452044425,"time_ago":"36 minutes ago","content":"<p>&gt; What kind of income would a person need to fathom affording something like that?<p>Depends heavily on how often they did it.  A quick estimate suggests that a request like that would cost a few hundred dollars at most: the cost of the food itself, packing it in an insulated box with cold packs (some restaurants can do that themselves, and if not, a shipping service could most likely do that quite cheaply), and about $100 to ship a package weighing a few pounds overnight.  Absolutely in the &quot;luxury&quot; category, but a few hundred dollars doesn&#x27;t seem wildly outlandish for someone making an average tech salary to choose to spend on a meaningful birthday gift for a close friend.<p>(I say &quot;meaningful&quot; because I&#x27;d tend to assume that the reason for the restaurant across the country would involve some kind of shared memory with the place, rather than just a wild whim.)","comments":[]}]},{"id":10847088,"level":1,"user":"cmikec","time":1452037262,"time_ago":"3 hours ago","content":"<p>Thank you so much for your comments, feedback, and kind words!","comments":[]}]},{"id":10847031,"level":0,"user":"tghw","time":1452036712,"time_ago":"3 hours ago","content":"<p>I just signed up to see if they could renegotiate my Comcast price for me. It turns out you have to buy either 10 hours at $100&#x2F;hour or 40 hours at $75&#x2F;hour to get started. That&#x27;s <i>way</i> too steep to try something out.","comments":[{"id":10847161,"level":1,"user":"newman314","time":1452037978,"time_ago":"2 hours ago","content":"<p>Lol. Great idea although it would likely take longer than that.<p>I would however pay for an outcome based solution to this as it&#x27;s a pain to call Comcast every year. Renegotiate to $X for Y and I&#x27;ll pay.","comments":[{"id":10847522,"level":2,"user":"tghw","time":1452041912,"time_ago":"an hour ago","content":"<p>Have you seen <a href=\"https:&#x2F;&#x2F;www.billfixers.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.billfixers.com&#x2F;</a>?","comments":[]}]},{"id":10847314,"level":1,"user":"chemmail","time":1452039886,"time_ago":"2 hours ago","content":"<p>It will probably take those 10 hours being on old for comcast to pickup. You think i&#x27;m joking.","comments":[{"id":10847824,"level":2,"user":"JoshTriplett","time":1452044631,"time_ago":"32 minutes ago","content":"<p>Considering that many kinds of common requests would likely involve waiting on hold, I&#x27;d be surprised if they didn&#x27;t contract out to some cheap automated service to handle &quot;wait until this goes off hold and then connect me to them&quot;.","comments":[]},{"id":10847401,"level":2,"user":"hammock","time":1452040901,"time_ago":"2 hours ago","content":"<p>But is it worth $1000?","comments":[]}]},{"id":10847217,"level":1,"user":"cscharenberg","time":1452038595,"time_ago":"2 hours ago","content":"<p>I was just reading about a company started by 2 brothers that does exactly this. If I can remember the name, I&#x27;ll post back. Maybe I saw it in Bloomberg? Anyone?","comments":[{"id":10847345,"level":2,"user":"jacobevelyn","time":1452040203,"time_ago":"2 hours ago","content":"<p>It might be BillFixers? (<a href=\"https:&#x2F;&#x2F;www.billfixers.com\" rel=\"nofollow\">https:&#x2F;&#x2F;www.billfixers.com</a>)<p>The Bloomberg article you may have read: <a href=\"http:&#x2F;&#x2F;www.bloomberg.com&#x2F;news&#x2F;articles&#x2F;2015-09-10&#x2F;billfixers-haggles-with-companies-to-get-your-bills-reduced\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bloomberg.com&#x2F;news&#x2F;articles&#x2F;2015-09-10&#x2F;billfixers...</a>","comments":[{"id":10847831,"level":3,"user":"BillFixers","time":1452044724,"time_ago":"31 minutes ago","content":"<p>That&#x27;s us! I don&#x27;t want to do a sales pitch or any thing, but if I can answer any questions about the service (or Comcast or whoever), feel free to ask away!<p>(also our hosting isn&#x27;t handling the traffic super well, so if you have any trouble visiting the site, but want to sign up or have questions, feel free to shoot me an email personally at ben@billfixers.com","comments":[]},{"id":10847518,"level":3,"user":"tghw","time":1452041891,"time_ago":"an hour ago","content":"<p>If so, they charge 50% of the annual savings. That&#x27;s steeper than a couple of hours of Magic+.","comments":[{"id":10847947,"level":4,"user":"lanewinfield","time":1452046466,"time_ago":"2 minutes ago","content":"<p>Not if you have to buy a minimum of 10 hours AND with BillFixers, you&#x27;re getting a DEFINITE savings of 100% of whatever you paid them.","comments":[]}]},{"id":10847547,"level":3,"user":"cscharenberg","time":1452042070,"time_ago":"an hour ago","content":"<p>Yes, that&#x27;s it. Thanks for finding it.","comments":[]}]},{"id":10847499,"level":2,"user":"web007","time":1452041739,"time_ago":"an hour ago","content":"<p>Maybe thinking of AirPaper? Not taking new customers at this time.<p>Some co-workers have raved about <a href=\"https:&#x2F;&#x2F;www.fancyhands.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.fancyhands.com&#x2F;</a> for this kind of stuff, not sure if that&#x27;s any different from Magic, though.","comments":[]},{"id":10847458,"level":2,"time":1452041427,"time_ago":"an hour ago","content":"[deleted]","deleted":true,"comments":[]}]},{"id":10847441,"level":1,"user":"PhasmaFelis","time":1452041274,"time_ago":"an hour ago","content":"<p>I feel like, if your income is such that you care about your Comcast bill, you are really not the target market for Magic+. This is aimed squarely at the Rolex-and-Lexus set.","comments":[{"id":10847510,"level":2,"user":"tghw","time":1452041851,"time_ago":"an hour ago","content":"<p>An hour of my time is worth more than an hour of their time costs. And that&#x27;s without counting the headache of doing it. Considering it would save me money for less than I would &quot;spend&quot; doing it myself, I don&#x27;t see how it&#x27;s not an application for most people.","comments":[{"id":10847892,"level":3,"user":"PhasmaFelis","time":1452045686,"time_ago":"15 minutes ago","content":"<p>If you&#x27;re saying that you make &gt;$100&#x2F;hour, then you are a long, long way from &quot;most people.&quot;","comments":[]}]}]}]},{"id":10846636,"level":0,"user":"minimaxir","time":1452033444,"time_ago":"4 hours ago","content":"<p>I really am not a fan of the hyperminimalistic &quot;we can do anything trust us!&quot; landing pages that <i>every</i> text-for-personal-assistant seems to think is brilliant marketing copy.<p>There are examples of Magic+ <i>requests</i>, but no real-world examples of <i>outcomes</i> and whether the request was filled successfully to the customer&#x27;s satisfaction.<p>Relatedly, the $100&#x2F;hr is suspicious because it&#x27;s impossible to audit the time spent by the assistant. (Contrast with flat fees stated upfront from the normal service.)","comments":[{"id":10846755,"level":1,"user":"cmikec","time":1452034574,"time_ago":"3 hours ago","content":"<p>Thanks for the feedback.  Magic has been in an interesting position as a startup ever since our website went viral in Feb. 2015. Starting then, we&#x27;ve had more demand than supply for our product every single day. That&#x27;s why we never iterated our original landing page -- marketing was never our biggest problem, in fact it was our smallest.  That said, I completely agree with you, that there would be much more powerful ways of communicating that you can trust us. Most of our signups come from word of mouth from real users at this point though, so it&#x27;s not as much of an issue.<p>For our $100&#x2F;hr Magic+ product, we display detailed reports daily to users that show exactly how time was used down to the second. I agree that communicating this correctly is key. If you&#x27;re interested in trying it, I&#x27;d love to hear your feedback on how we display this information.","comments":[{"id":10847153,"level":2,"user":"newman314","time":1452037874,"time_ago":"2 hours ago","content":"<p>Even if the time is broken down, what&#x27;s the incentive to be as efficient&#x2F;cost-effective as possible? I get that cost is not the primary driver here but surely it is not open-ended.<p>Also, invariably with a complex task, there&#x27;s going to be a lot of dead time spent waiting while coordinating.","comments":[{"id":10847671,"level":3,"user":"digbyloftus","time":1452043072,"time_ago":"an hour ago","content":"<p>Isn&#x27;t that effectively a problem for any hourly based service? What&#x27;s the incentive for a lawyer, accountant, developer, anyone to be as cost effective as possible? Surely the answer to that (happy customers, repeat business, referrals) would apply here as well. Even if hypothetically it wasn&#x27;t as efficient as possible yet they still managed to deliver quality results, whats the problem? You&#x27;re paying for results not effort, no?","comments":[]},{"id":10847336,"level":3,"user":"ehaughee","time":1452040130,"time_ago":"2 hours ago","content":"<p>Maybe in that scenario, &quot;time spent waiting&quot;, they don&#x27;t charge?  Seems like they wouldn&#x27;t want to waste those cycles, but I see your point with regards to incentivisation.","comments":[]}]},{"id":10846864,"level":2,"user":"amorphid","time":1452035290,"time_ago":"3 hours ago","content":"<p>Demand for your service that exceeds your capacity to deliver is a high class problem :)","comments":[]},{"id":10846790,"level":2,"time":1452034792,"time_ago":"3 hours ago","content":"[deleted]","deleted":true,"comments":[]},{"id":10847686,"level":2,"user":"bby","time":1452043269,"time_ago":"an hour ago","content":"<p>can you show us an example of such a detailed report, without us having to use the service? thx","dead":true,"comments":[]},{"id":10846786,"level":2,"time":1452034770,"time_ago":"3 hours ago","content":"[deleted]","deleted":true,"comments":[{"id":10846842,"level":3,"user":"cmikec","time":1452035110,"time_ago":"3 hours ago","content":"<p>Currently these reports are sent via email. We may have an app at some point in the future, but currently SMS and email are more than sufficient.","comments":[]},{"id":10846809,"level":3,"user":"daurnimator","time":1452034903,"time_ago":"3 hours ago","content":"<p>Easy enough to send a link to a webpage. Or ask you for your email to send it to you.","comments":[]}]}]},{"id":10846744,"level":1,"user":"seangrant","time":1452034500,"time_ago":"3 hours ago","content":"<p>I feel like the whole thing is being oversold. They&#x27;re making huge claims on this page and I have no idea whether or not they&#x27;re true.<p><pre><code>  &gt; Never says no\n\n  &gt; Hits 100% of promises and expectations\n</code></pre>\nI&#x27;m sure these are achievable...","comments":[{"id":10846846,"level":2,"user":"Reedx","time":1452035148,"time_ago":"3 hours ago","content":"<p>Yeah, pretty hyperbolic. There are a lot of cases where they will have to say no or &quot;sorry, we&#x27;ll have to set that up for another time&quot;. Some requests are simply not always possible.<p>To pick one of their examples:<p>&quot;I need to rent out the Exploratorium this weekend.&quot;<p>What if someone already rented it out? Or it&#x27;s under construction? Or there&#x27;s a special event? Or *?","comments":[{"id":10846917,"level":3,"time":1452035706,"time_ago":"3 hours ago","content":"[deleted]","deleted":true,"comments":[{"id":10846941,"level":4,"user":"Someone1234","time":1452036000,"time_ago":"3 hours ago","content":"<p>Where&#x27;s the &quot;Uber of assassins&quot; when you them?","comments":[]},{"id":10846927,"level":4,"user":"Nadya","time":1452035869,"time_ago":"3 hours ago","content":"<p><i>&gt;Anything you want. As long as it’s not illegal. Seriously. </i><p>I think murder falls under the illegal category of exception.","comments":[{"id":10847002,"level":5,"user":"derefr","time":1452036494,"time_ago":"3 hours ago","content":"<p>I wonder whether one could use Magic to hire a prostitute in Nevada, given that they&#x27;re a California company presumably incorporated in Delaware.<p>Which is a more localized version of the question I really want to ask: if Magic ever expands outside of the US, could I use it to order Cuban cigars to be shipped to Canada from Cuba? The US would never have to import them—so no illegal&#x2F;trade-sanctioned act is occurring—but an American company is still profiting from the exchange.","comments":[{"id":10847121,"level":6,"user":"tempestn","time":1452037606,"time_ago":"2 hours ago","content":"<p>Aren&#x27;t Cuban goods legal in the US now?<p>Ah, apparently only sort of: <a href=\"http:&#x2F;&#x2F;www.washingtonexaminer.com&#x2F;can-you-buy-cuban-cigars-now&#x2F;article&#x2F;2567534\" rel=\"nofollow\">http:&#x2F;&#x2F;www.washingtonexaminer.com&#x2F;can-you-buy-cuban-cigars-n...</a>","comments":[]}]}]}]}]},{"id":10846955,"level":2,"user":"cmikec","time":1452036092,"time_ago":"3 hours ago","content":"<p>Thanks for bringing this up. We&#x27;ve adjusted these bullet points to make them more accurate.","comments":[]},{"id":10846825,"level":2,"user":"patmcc","time":1452034989,"time_ago":"3 hours ago","content":"<p>Given unlimited funds, anything possible is easy for the guy writing the cheque.<p>If I was willing to foot the bill, you could probably do any of the example magics listed (assuming you had my details&#x2F;logins to email&#x2F;calendar) in an hour or two.","comments":[{"id":10846886,"level":3,"time":1452035442,"time_ago":"3 hours ago","content":"[deleted]","deleted":true,"comments":[]}]}]}]},{"id":10847277,"level":0,"user":"exogen","time":1452039238,"time_ago":"2 hours ago","content":"<p>I haven&#x27;t used the $100&#x2F;hour Magic+, but I&#x27;ve used Magic several times. I ordered sushi when it was first announced and the HN comment about my experience got a lot of interest.<p>Once I used it to order fried chicken from a deli that isn&#x27;t available via any delivery service. That was nice.<p>The coolest thing by far was using it to buy a gift. I follow an embroidery artist on Instagram, and noticed she was doing a pop-up shop in Chicago (I live in Seattle). I directly inquired about commissioning pieces or buying her existing pieces, but it just wasn&#x27;t possible – this pop-up shop was the only way. I showed Magic a few of the pieces I liked best on Instagram, gave them a price limit (no idea even how much they were selling for), and described how there were only a few of these things available and they&#x27;d probably be gone fast. They sent someone there and managed to get one for me and mail it!","comments":[]},{"id":10847126,"level":0,"user":"spdustin","time":1452037646,"time_ago":"2 hours ago","content":"<p>1) How does one become a Magic+ &quot;Magician&quot;?<p>2) Do the Magicians post a surety bond to Magic for liability-related losses? Does Magic have third party fidelity bonds to help defend against suits brought against them due to fraudulent actions by (I assume) contractor Magicians? Disclaiming all liability and hold harmless agreements can be problematic in reality, given the example market of impulse iPad Pro buyers could easily be envisioned to have enough resources to litigate Magic into oblivion.<p>3) Do Magicians undergo any kind of background checking?<p>If I&#x27;m going to trust a service with information otherwise protected by regularly rotated credentials and TFA - and I&#x27;m not beyond doing that, since the pricing for dependable and trustworthy (and bonded&#x2F;insured) assistants for ad-hoc tasks doesn&#x27;t seem too offensive to me - I&#x27;d want to know my risks.<p>I know that doesn&#x27;t make for <i>magical</i> copy on a landing page, but it&#x27;s a selling point. I used the original Magic pretty early on, getting a rather esoteric accessory for some discontinued on-ear studio monitors, and I was impressed by their professionalism. If the pricing goes to the next level, the professionalism needs to follow, in my opinion.","comments":[{"id":10847597,"level":1,"user":"flippyhead","time":1452042433,"time_ago":"an hour ago","content":"<p>Maybe you could use Magic+ to audit the legal practices of Magic.","comments":[]},{"id":10847703,"level":1,"user":"bby","time":1452043464,"time_ago":"an hour ago","content":"<p>why isn&#x27;t mike answering this question like he did with the other questions...","dead":true,"comments":[]}]},{"id":10847135,"level":0,"user":"dcpdx","time":1452037728,"time_ago":"2 hours ago","content":"<p>This is like Tesla entering the market with a high end sports car, or Uber entering the market with only black cars.  They&#x27;re targeting a smaller niche of wealthy early adopters to tweak the service and revenue model and will eventually move downmarket to address a broader customer base (if they&#x27;re successful with this initial niche).  This is an ideal niche to start with because a) they have the money for it b) they&#x27;re more tech savvy and generally forgiving of product shortfalls for bleeding edge services and c) they have lots of connections and can spread word-of-mouth more effectively (think Chris Dixon).  It will be interesting to see if this becomes more of an API for other on-demand platforms such as Seamless or if it will be standalone.  Also curious to see how this will stack up to Facebook&#x27;s M and if they&#x27;ve built something defensible enough to pose a real threat.","comments":[{"id":10847768,"level":1,"user":"timr","time":1452044087,"time_ago":"41 minutes ago","content":"<p>The metaphor is faulty. Uber hasn&#x27;t brought down the cost of limousine service, and it didn&#x27;t make cars cheaper or more efficient to create UberX -- it just tapped into a larger market of drivers who were willing to do commodity work for less money.<p>You don&#x27;t pay people $100 an hour for commodity work. Unless you&#x27;re so rich that price doesn&#x27;t matter, I guess.","comments":[{"id":10847936,"level":2,"user":"dcpdx","time":1452046309,"time_ago":"4 minutes ago","content":"<p>Perhaps I should have extended it a bit more--as someone else commented, they will likely drive the price point down as the tech improves and they&#x27;re able to do things algorithmically which will reduce overhead.  The Tesla strategy is probably a better fit here than Uber, though.","comments":[]}]}]},{"id":10847914,"level":0,"user":"snydly","time":1452045961,"time_ago":"10 minutes ago","content":"<p>So wait... did I miss the part about what happens if they fail to do what I ask? What happens then?<p>&quot;Finish my dissertation. Thanks.&quot;","comments":[]},{"id":10847691,"level":0,"user":"bigtunacan","time":1452043333,"time_ago":"an hour ago","content":"<p>This sounds a bit like Uber for personal assistants. So for people in the top 1% they can now have 24&#x2F;7 personal assistants at probably about the same cost as they previously paid for a 9 to 5-er.<p>Then a middle man skims most of the profits while all of the personal assistants of the world lose job stability and end up having to work 80 hours a week as &quot;personal contractors&quot; to try and break even with what they previously made in a 40 hour work week.<p>Yeah; I&#x27;m a bit skeptical.","comments":[]},{"id":10846763,"level":0,"user":"omarforgotpwd","time":1452034633,"time_ago":"3 hours ago","content":"<p>Good morning,\nI read all your email while you slept. Your wife is very pretty. I wrote a message to your son telling him you loved him. He responded &quot;you&#x27;re not my real dad&quot;. I also hired that Visual Basic expert who emailed you yesterday. Don&#x27;t worry, I already charged your AMEX $230 for the trouble.","comments":[{"id":10847079,"level":1,"user":"cmikec","time":1452037192,"time_ago":"3 hours ago","content":"<p>This would be a real risk if you hired an ordinary personal assistant. This is actually exactly the sort of challenge that traditional assistants pose and that Magic+ is designed to fix.<p>Magic+ is actually not just one person, but it&#x27;s a software-driven service with a highly trained team of professional assistants that are held to a very high bar. They are managed, supervised, and trained by us so that you don&#x27;t have to worry about it.<p>And, on top of that, every task and request is managed from beginning to end using custom software that is designed specifically to monitor the execution strategy and enhance both the quality and the reliability of the output. It&#x27;s difficult for me to say more right now about how this works without disclosing IP that we cannot disclose at this time, but I hope to be able to say more about how this works in the future.<p>A good way to think about Magic+ is that it&#x27;s a natural-language command-line interface for complex tasks that require some human interaction.  A component of how we handle your email is more like a  ~&#x2F;.procmailrc file that can pipe things to a highly-supervised human assistant than it is like having a random person somewhere in the US logged in to your Gmail. You tell us how you need things done, using natural language, and it gets done, assuming it&#x27;s possible.<p>Again, I recognize that this explanation is not as detailed as it could be, but I hope that it helps. I will think about how we can explain this better before we are able to disclose the inner-workings of our software.","comments":[]},{"id":10846819,"level":1,"user":"shogun21","time":1452034975,"time_ago":"3 hours ago","content":"<p>- Requires no effort to train\n- Requires no effort to manage","comments":[]}]},{"id":10847617,"level":0,"user":"irascible","time":1452042597,"time_ago":"an hour ago","content":"<p>Seeing this makes me feel ashamed to be a part of the tech industry. This is why people despise the 1%. Show some taste&#x2F;humility&#x2F;discretion. A &quot;service&quot; like this is so narrowly focused on the ultra rich, that it should be marketing in high end magazines&#x2F;direct outreach.. not on hacker news.","comments":[{"id":10847687,"level":1,"user":"theli0nheart","time":1452043280,"time_ago":"an hour ago","content":"<p>I completely disagree. This service targets people who peg a higher value to their time than $100 &#x2F; hour and&#x2F;or are too busy to take on other tasks. This is valuable for anyone that runs their own business or who has an actual dollar amount pegged to their time (a large portion of HN readership), not just members of the 1%.<p>E.g., cancelling a doctor&#x27;s appointment takes 10 minutes. Even if you bill your time out at $50 &#x2F; hour, you&#x27;ve now saved yourself the trouble of making a random phone call for 16 bucks and remain focused on what you&#x27;re actually good at.","comments":[{"id":10847913,"level":2,"user":"npizzolato","time":1452045959,"time_ago":"10 minutes ago","content":"<p>Someone who values their time at $100&#x2F;hour, working 40 hours&#x2F;week, is making over $200,000 a year. I&#x27;m not sure if that technically qualifies as the 1%, but I think it&#x27;s close enough to the GP&#x27;s point.","comments":[]}]},{"id":10847772,"level":1,"user":"SomeCallMeTim","time":1452044118,"time_ago":"41 minutes ago","content":"<p>I&#x27;m a developer and I bill as much as $250&#x2F;hour. I could totally see paying someone $100&#x2F;hour to make something happen so that I could focus on a paying task.<p>Problem is that most tasks likely to waste my time are things that would take longer to delegate (due to detailed instructions, needing to answer questions about needs, needing to set them up with the ability to pay bills...) than to just do myself.","comments":[]},{"id":10847645,"level":1,"user":"meowface","time":1452042839,"time_ago":"an hour ago","content":"<p>How is this distasteful? First off, $100 for a &quot;we&#x27;ll do whatever you want service&quot; is <i>not</i> restricted to the ultra rich. But they also say they charge by the minute, not by the hour. If something only takes a few minutes, you pay ~$8.","comments":[]},{"id":10847666,"level":1,"user":"sparky_z","time":1452043002,"time_ago":"an hour ago","content":"<p>&quot;this is so narrowly focused on the ultra rich&quot;<p>So was Tesla initially. That didn&#x27;t make it unworthy of tech news coverage. As this sort of technology matures and become more accessible to the general public, it has a reasonable chance of being the &quot;next big thing&quot;. That makes its launch newsworthy to the people in the industry.","comments":[{"id":10847923,"level":2,"user":"npizzolato","time":1452046070,"time_ago":"8 minutes ago","content":"<p>What&#x27;s the technology here that needs to mature? Honest question, but it seems like just a high-end personal assistant on-demand that uses text messages to communicate. It&#x27;s not obvious to me what the tech is.","comments":[]}]},{"id":10847640,"level":1,"user":"Exuma","time":1452042782,"time_ago":"an hour ago","content":"<p>Oh please, give me a break.","comments":[]}]},{"id":10847047,"level":0,"user":"hackuser","time":1452036848,"time_ago":"3 hours ago","content":"<p>I would love to see more comments that provided value to other readers. There is so much expertise and intelligence in this forum, but so many discussions contain only what is easiest: obvious cyncism. It&#x27;s kind of fun banter once in a while, but gets old and isn&#x27;t worth spending the time reading.","comments":[]},{"id":10846844,"level":0,"user":"dyladan","time":1452035129,"time_ago":"3 hours ago","content":"<p>I thought this was satire. Came here to see the jokes. None of you seem to be treating it like satire though.","comments":[{"id":10846949,"level":1,"user":"Someone1234","time":1452036062,"time_ago":"3 hours ago","content":"<p>Why did you think it was satire? They&#x27;re just trying to offer a personal assistant service over the air, nothing that beyond imagination. Likely costs less than actually employing someone.","comments":[{"id":10847887,"level":2,"user":"npizzolato","time":1452045639,"time_ago":"15 minutes ago","content":"<p>I too thought it was satire. Two of their examples are &quot;I need to buy $2500 worth of electronics tonight like it&#x27;s nothing&quot; and &quot;get me a private helicopter tonight for $3500&quot;, all the while paying $100&#x2F;hour for the privilege.<p>I understand some people spend money like that, but it seemed more likely that someone was making a joke about absurd wealth and the startup scene than a real business. If the Onion wrote an article about it, I wouldn&#x27;t bat an eye.<p>Best of luck to the Magic+ team (honestly), but this product clearly isn&#x27;t for people like me.","comments":[]},{"id":10847106,"level":2,"user":"duaneb","time":1452037452,"time_ago":"3 hours ago","content":"<p>You wanna know what&#x27;s great about actually employing someone? They can actually devote their full attention to you. They&#x27;ll also get the door for you; can Magic+ do that?","comments":[{"id":10847247,"level":3,"user":"sparky_z","time":1452038879,"time_ago":"2 hours ago","content":"<p>That person you hire can&#x27;t split themselves into 10 people on demand, nor are they easily replaced if they go on vacation or get sick. This seems to me the PA equivalent of using AWS rather than owning and maintaining your own servers. There are some potential drawbacks, yes, but there are also a lot of potential upsides, depending on your needs.","comments":[]}]}]},{"id":10847164,"level":1,"time":1452038002,"time_ago":"2 hours ago","content":"[deleted]","deleted":true,"comments":[]}]},{"id":10846833,"level":0,"user":"pazimzadeh","time":1452035050,"time_ago":"3 hours ago","content":"<p>Episode 5 of Rick and Morty&#x27;s first season is relevant (the Mister Meeseeks episode).","comments":[{"id":10846936,"level":1,"user":"mikeash","time":1452035955,"time_ago":"3 hours ago","content":"<p>So, don&#x27;t ask them to take two strokes off my golf game?","comments":[]},{"id":10847140,"level":1,"user":"SandersAK","time":1452037776,"time_ago":"2 hours ago","content":"<p>OOOOOH YEAH, CAN DO!","comments":[]},{"id":10847000,"level":1,"user":"Splines","time":1452036486,"time_ago":"3 hours ago","content":"<p>Magic- (Magic-ish)<p>Text this number to get a regular human assistant for $50&#x2F;hr: xxxxx<p>Using Magic-, you have a regular power - highly trained Magicians can ask regular people for help with minor tasks. Send our very normal people a text message 24&#x2F;7, and you can get help doing your very magical things.","comments":[]}]},{"id":10846765,"level":0,"user":"xirdstl","time":1452034641,"time_ago":"3 hours ago","content":"<p>The examples are puzzling to me. Take this one:\n&quot;I’m out of the office today. Check my email and let me know if there’s anything urgent.&quot;<p>Are they proposing we should be ok with giving them our credentials?","comments":[{"id":10846783,"level":1,"user":"cmikec","time":1452034758,"time_ago":"3 hours ago","content":"<p>Many of our users give us access to various aspects of their personal and work lives in order to gain the benefit of efficiency and saved time.  We also set up users who don&#x27;t want to share their primary email with email addresses at our domain.","comments":[]}]},{"id":10847912,"level":0,"user":"biot","time":1452045939,"time_ago":"10 minutes ago","content":"<p>Show HN: I asked Magic+ to build me a Magic+ clone (getyourmagic.io)<p>With their promise of &quot;Anything you want. Seriously.&quot; how long before we see that? :)","comments":[]},{"id":10847015,"level":0,"user":"captaindiego","time":1452036608,"time_ago":"3 hours ago","content":"<p>It says it works from anywhere, but then only gives a number that works from within the US. How are you supposed to use this service while in another country and not having access to a US sim card?","comments":[{"id":10847275,"level":1,"user":"MagnumOpus","time":1452039212,"time_ago":"2 hours ago","content":"<p>If you are in the target group that is willing to pay $100&#x2F;hour for a virtual assistant at the beck and call of an SMS, then the $0.20 or so for the SMS roaming charges seems like small change...","comments":[{"id":10847849,"level":2,"user":"biot","time":1452045079,"time_ago":"25 minutes ago","content":"<p>Assuming they have a +1 ... internationally available SMS number. 5 digit shortcodes aren&#x27;t guaranteed to work globally.","comments":[]},{"id":10847869,"level":2,"user":"foobarqux","time":1452045428,"time_ago":"19 minutes ago","content":"<p>I don&#x27;t think US shortcodes are reachable internationally.","comments":[]}]},{"id":10847683,"level":1,"user":"huckyaus","time":1452043234,"time_ago":"an hour ago","content":"<p>The regular version of their service still appears to be US-only[0] (last FAQ item). I suspect that Magic+ is also US-only and they&#x27;ve neglected to mention it specifically on this page.<p>[0] <a href=\"https:&#x2F;&#x2F;getmagicnow.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;getmagicnow.com&#x2F;</a>","comments":[]}]},{"id":10847092,"level":0,"user":"Rauchg","time":1452037281,"time_ago":"3 hours ago","content":"<p>I use Magic occasionally and it&#x27;s been wonderful every time. It&#x27;s definitely not something I would use everyday, but it&#x27;s been great for:\n- a time I needed a replacement power supply cable, and really didn&#x27;t have the time to research where to get it, and needed it urgently. \n- a couple times where I needed a dinner reservation for relatives or friends visiting\n- quick questions about things to do or places to go<p>I definitely recommend the basic version!","comments":[]},{"id":10846931,"level":0,"user":"kilroy123","time":1452035884,"time_ago":"3 hours ago","content":"<p>$100 an hour? Fuck that.<p>I&#x27;m currently living abroad and don&#x27;t speak the language very well. So I hired a virtual assistant who speaks the language and English. He charges $7.50 USD an hour. I only pay him for time it takes to complete my tasks. I rarely even pay $100 for the whole month.","comments":[{"id":10847063,"level":1,"user":"mmahemoff","time":1452036963,"time_ago":"3 hours ago","content":"<p>Or maybe you&#x27;re not the target market?<p>This is like people getting mad at Heroku or Github when some commodity host costs a tenth the price. Thankfully you have a choice and no-one is forcing you to use it.","comments":[]},{"id":10846998,"level":1,"user":"jamifsud","time":1452036480,"time_ago":"3 hours ago","content":"<p>From where did you hire?","comments":[]},{"id":10847429,"level":1,"user":"eibrahim","time":1452041206,"time_ago":"an hour ago","content":"<p>Where did you hire him&#x2F;her?  I use fancy hands but would love to have a dedicated person","comments":[]},{"id":10847498,"level":1,"user":"MatthewMcDonald","time":1452041732,"time_ago":"an hour ago","content":"<p>What&#x27;s his response time, and what does his availability look like?","comments":[]}]},{"id":10846694,"level":0,"user":"pbreit","time":1452033876,"time_ago":"4 hours ago","content":"<p>$100 an hour sounds expensive. $1&#x2F;minute might be a better published price. And also suggest that it&#x27;s priced in minute increments.","comments":[{"id":10846731,"level":1,"user":"Reedx","time":1452034305,"time_ago":"3 hours ago","content":"<p>Well, they&#x27;re targeting people who want on demand helicopters. I feel like $100&#x2F;hr makes sense given that context.","comments":[{"id":10846748,"level":2,"user":"shogun21","time":1452034517,"time_ago":"3 hours ago","content":"<p>These are people who buy an iPad Pro in the checkout line on a whim.","comments":[{"id":10847049,"level":3,"user":"zobzu","time":1452036860,"time_ago":"3 hours ago","content":"<p>And suddenly decide to next-hour ship it to their mum (again according to examples)","comments":[]}]}]},{"id":10846768,"level":1,"user":"cmikec","time":1452034655,"time_ago":"3 hours ago","content":"<p>Thanks for the feedback. You&#x27;re right, you bring up a good point that isn&#x27;t explained as much on the website as it could be. We actually track time down to the second and display really detailed reports to users every day about how the time was utilized. Quite often a simple request can end up being $3-$4.","comments":[{"id":10847149,"level":2,"user":"danielki","time":1452037846,"time_ago":"2 hours ago","content":"<p>Is there a way to set a maximum price or time you&#x27;re willing to pay for each request? My biggest hesitation about using something like this would be that it would end up costing way more than I anticipated - something I expect to take 30 minutes could take 4 hours cost $400 instead of $50.","comments":[]},{"id":10847084,"level":2,"user":"vonklaus","time":1452037233,"time_ago":"3 hours ago","content":"<p>I know why detailed reporting is important, I just have to assume that anyone paying for this is not price sensitive.<p>Transparency and trust, one would imagine, are the core pieces of the business maybe even in front of task execution so it makes sense, but still, if I bought a 1200 ipad via SMS because I was too lazy to drive to walmart I probably don&#x27;t need the reciept.","comments":[]},{"id":10847494,"level":2,"user":"pbreit","time":1452041702,"time_ago":"an hour ago","content":"<p>To-the-second metering sounds awful.","comments":[]}]},{"id":10846741,"level":1,"user":"pierre_massat","time":1452034460,"time_ago":"3 hours ago","content":"<p>That would change the price of the hour. We can still say $1.66 per minute but less appealing than $1.","comments":[{"id":10847490,"level":2,"user":"pbreit","time":1452041650,"time_ago":"an hour ago","content":"<p>Then it also solves too-high pricing.","comments":[]}]}]},{"id":10846828,"level":0,"user":"stephenc_c_","time":1452035009,"time_ago":"3 hours ago","content":"<p>So this is just Amex Plat&#x2F;Centurion concierge for people who prefer to text than call?","comments":[{"id":10846929,"level":1,"user":"derefr","time":1452035875,"time_ago":"3 hours ago","content":"<p>That&#x27;s exactly the comparison I wanted to make as well. I thought of the original Magic service as &quot;a Visa Black Card concierge-service automated and scaled enough to target the middle class&quot;; this just returns it to the parent concept.","comments":[{"id":10847028,"level":2,"user":"TranquilMarmot","time":1452036705,"time_ago":"3 hours ago","content":"<p>I don&#x27;t think the middle class has $3,750 to spend on a helicopter ride to the airport...","comments":[{"id":10847050,"level":3,"user":"derefr","time":1452036861,"time_ago":"3 hours ago","content":"<p>Presumably the people using Magic for that sort of thing were the upper-class &quot;money left on the table&quot; that&#x27;s being picked up here. Most Magic requests, from what I take it, are more for the same lazy-person-making-100K things like to-your-door grocery delivery that other services provide.","comments":[]}]}]},{"id":10847265,"level":1,"user":"ryan-c","time":1452039148,"time_ago":"2 hours ago","content":"<p>I&#x27;ve used Visa Signature concierge a couple of times and have found it to be very &#x27;meh&#x27;. The last time I called them they seemed to have limited the scope of what they&#x27;d do to making reservations and travel arrangements.","comments":[]},{"id":10846876,"level":1,"user":"peteretep","time":1452035395,"time_ago":"3 hours ago","content":"<p>Have you tried Amex Platinum concierge? If they can deliver, this looks better in practice.","comments":[{"id":10847144,"level":2,"user":"umeshunni","time":1452037811,"time_ago":"2 hours ago","content":"<p>The number of interactions (over email) that I need to have with them to get even a simple request like a restaurant reservation done from Amex Platinum concierge has made me look around for alternatives. \nFWIW, even Facebook&#x27;s assistant &#x27;M&#x27; is far better at handling tasks that Platinum concierge.","comments":[]},{"id":10847355,"level":2,"user":"Jack000","time":1452040397,"time_ago":"2 hours ago","content":"<p>not sure what the amex platinum version is like, but I wasn&#x27;t that impressed with the visa infinite version.<p>I asked them to go through the craigslist of another city and find a certain car for sale, then return a list sorted by mileage and price. They couldn&#x27;t do that for whatever reason and just offered to give me the KBB value.<p>Took me 5+ minutes to navigate their phone menu, enter my card number and get to the service.","comments":[]},{"id":10846989,"level":2,"user":"modoc","time":1452036350,"time_ago":"3 hours ago","content":"<p>FWIW I&#x27;ve been very impressed by what the Amex Plat concierge can do","comments":[{"id":10847173,"level":3,"user":"gcr","time":1452038143,"time_ago":"2 hours ago","content":"<p>Do you have any fun examples?","comments":[]}]}]}]},{"id":10847493,"level":0,"user":"omarish","time":1452041690,"time_ago":"an hour ago","content":"<p>Based on everything I learned about this space from starting, operating, and later selling a company that does exactly this in the summer of 2014 [1] [2], I&#x27;m bullish on this idea. I think it&#x27;s definitely a step in the right direction and incentives are starting to line up.<p>The &quot;I&#x27;ll do anything for you by SMS&quot; space (I call it the &quot;Houdini app&quot; space) space affords the middle-to-upper class in first world countries (where labor is much more expensive) the same power you&#x27;d get if you were in a country where labor is much cheaper.<p>Example: in Lebanon, where I grew up, the middle-to-upper class of the population has: a stay-at-home maid ($200&#x2F;mo), a driver ($300&#x2F;mo), and a concierge at the bottom of their building ($30&#x2F;mo), who will take care of pretty much anything for you. This is possible because labor is so cheap. I&#x27;d say you have to be in the 0.1% in the US to be able to afford this (since labor would cost you much more), but in third world countries, it&#x27;s within reach of probably the top 15% of the population (by income).<p>I think the most successful concierges have a &quot;fixer&quot; mindset - you give them a very loosely defined need, and their job is 1) coordinating and finding a solution, and 2) actually following through and executing on it. The fixer&#x27;s advantage is 1) the end user trusts them, trusts their taste, and there is a pre-existing relationship with the customer, and 2) the user has a general idea of what they can and cannot do.<p>The real value Magic brings is that they can be the fixer for your day-to-day life. If I were Magic, I&#x27;d change the pricing to $200&#x2F;hour, but only charged if the task is actually completed. That way, the incentives really line up in that 1) they&#x27;re more incentivized to complete the task successfully, 2) users trust them a lot more and know that they will get their money&#x27;s worth, and 3) they develop the &quot;fixer&quot; brand, where Magic gets you what you want, and you only have to pay if it gets done.<p>Lots of important technologies start off as &quot;toys for the rich&quot; - I could see that happening here too. What I am curious to see, is how they plan on bringing the cost of the service down. Or if it&#x27;s possible to get a big enough market share at this price point.<p>[1] <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=8094351\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=8094351</a><p>[2] <a href=\"http:&#x2F;&#x2F;nymag.com&#x2F;daily&#x2F;intelligencer&#x2F;2014&#x2F;08&#x2F;my-disruptive-deputy.html\" rel=\"nofollow\">http:&#x2F;&#x2F;nymag.com&#x2F;daily&#x2F;intelligencer&#x2F;2014&#x2F;08&#x2F;my-disruptive-d...</a>","comments":[{"id":10847598,"level":1,"user":"fady","time":1452042436,"time_ago":"an hour ago","content":"<p>crazy. my family also lived in lebanon(zahle), and they had two maids, a driver, and a lady to come to the house and roll grape leaves for them but they still had to get their water delivered, which did cost a lot.  they were not rich by american standards at all.<p>good thoughts..would be great to get these services on the cheap out here. Lyft of grape leaves rolling? ha.","comments":[{"id":10847628,"level":2,"time":1452042674,"time_ago":"an hour ago","content":"[deleted]","deleted":true,"comments":[]},{"id":10847629,"level":2,"user":"omarish","time":1452042675,"time_ago":"an hour ago","content":"<p>Haha, Wara2 3in-App.","comments":[]}]}]},{"id":10847599,"level":0,"user":"bredren","time":1452042443,"time_ago":"an hour ago","content":"<p>I&#x27;d love to try this, as there is an out-of-production bag that is probably out there but I could not find this holiday season.<p>People aren&#x27;t mentioning this here, but the real sticker shock is not $100 &#x2F; hour but rather that to get that price you have to be ready to pay $1000 now or sign up for a $3000 a month subscription (that also begins now)<p>The low-key information page doesn&#x27;t really set you up for that level of commitment to check things out.","comments":[{"id":10847924,"level":1,"user":"TulliusCicero","time":1452046082,"time_ago":"8 minutes ago","content":"<p>I think it makes sense that they only want people who are serious about it. If they didn&#x27;t have a high up-front entry cost, they&#x27;d inevitably end up with lots of pranksters &#x27;trying out&#x27; the service with ludicrous&#x2F;dumb requests (&quot;make my wife love me again&quot;; &quot;buy twenty pizzas, then hurl them into the ocean at this exact point&quot;) and bogging things down.","comments":[]}]},{"id":10847904,"level":0,"user":"eruannon","time":1452045888,"time_ago":"11 minutes ago","content":"<p>Wow, these guys are desperate for a pivot after getting torpedoed by Facebook M, huh?","comments":[]},{"id":10846769,"level":0,"user":"relaxatorium","time":1452034656,"time_ago":"3 hours ago","content":"<p>The example they&#x27;re trying to use to show you that prices <i>aren&#x27;t</i> crazy quotes a $30+ surcharge for having groceries delivered.","comments":[{"id":10847020,"level":1,"user":"TranquilMarmot","time":1452036629,"time_ago":"3 hours ago","content":"<p>I really loved the $3,750 helicopter ride to the airport, like your average joe has that much money to blow so they don&#x27;t have to sit in traffic. I guess I&#x27;m just not in their target demographic?","comments":[{"id":10847215,"level":2,"user":"gcr","time":1452038587,"time_ago":"2 hours ago","content":"<p>I like that copy. It signals who they expect their customers to be.","comments":[]}]}]},{"id":10846805,"level":0,"user":"habosa","time":1452034888,"time_ago":"3 hours ago","content":"<p>“Find someone to train me like Jason Bourne.”\n“Get me a mobile dentist to my office ASAP.”\n“I want to meet Tina Fey and Amy Poehler.”\n“I need to rent out the Exploratorium this weekend.”\n“I need 6 convertibles tomorrow for rent.”\n“Organize my team for a town hall tomorrow.”\n“My 1 pm ran over. Bump my meetings back 1 hour.”\n“I’m out of the office today. Check my email and let me know if there’s anything urgent.”<p>They&#x27;re going way over the top here to market it to busy douchebags.  I thought about using it until I saw who they think I might be.","comments":[{"id":10846863,"level":1,"user":"cmikec","time":1452035276,"time_ago":"3 hours ago","content":"<p>These are all real requests that our users have actually used Magic+ for. We obviously cant divulge their identities, or show photographs, etc. (since these are personal things), but it&#x27;s important to convey how people really use the service. I&#x27;d love ideas on how we can communicate this point better. Part of what our users love about Magic+ is that you truly can   do some pretty amazing things with it.","comments":[{"id":10846896,"level":2,"user":"ethbro","time":1452035508,"time_ago":"3 hours ago","content":"<p>If there&#x27;s a way to anonymize data (or even just flag requests as anonymous in content), it&#x27;d be nice to have a bit more of a randomly picked live feed.<p>I think some of the incredulity is that there&#x27;s... an authenticity skepticism as to how much these represent average requests (and therefore responses). But like you said -- if you don&#x27;t have a marketing problem, who cares what the HN peanut gallery says. ;)","comments":[]},{"id":10847104,"level":2,"user":"jameshart","time":1452037439,"time_ago":"3 hours ago","content":"<p>If that conveys how people really use the service, then, to many people, it also conveys that the people who use the service are, on average, lazy rich douchebags. If that isn&#x27;t what you want to portray about your brand, you might want to reconsider your examples.","comments":[{"id":10847237,"level":3,"user":"tempestn","time":1452038820,"time_ago":"2 hours ago","content":"<p>It conveys that the users are rich, yes.  What about it makes them lazy or douchebags?  Assuming you&#x27;re rich, is it a logical use of your time to, for instance, go through the process of tracking down and renting a bunch of cars for some event online?  Or would it make more sense to pay someone else $100&#x2F;hour (considerably less than the opportunity cost of doing it yourself) to do it for you?<p>Does wanting to meet a celebrity make you a lazy douchebag?  Or is it the presumption that it might actually be possible?  Renting a venue last minute?  Perhaps they lazily left it until the last minute, but perhaps there&#x27;s another explanation?<p>The Jason Bourne one is eccentric at least, but surely wanting to engage in that kind of extreme training is anything but lazy.","comments":[]}]},{"id":10847864,"level":2,"user":"kzhahou","time":1452045297,"time_ago":"21 minutes ago","content":"<p>So did they meet Tina Fey and Amy Poehler, and how did you arrange that?","comments":[]},{"id":10846965,"level":2,"user":"Someone1234","time":1452036160,"time_ago":"3 hours ago","content":"<p>Did you fulfil any of these requests?","comments":[{"id":10846994,"level":3,"user":"cryptoz","time":1452036406,"time_ago":"3 hours ago","content":"<p>They claim to have fulfilled 100% of requests. Seems like a lie, though.","comments":[{"id":10847042,"level":4,"user":"TranquilMarmot","time":1452036798,"time_ago":"3 hours ago","content":"<p>I find it hard to believe Amy Poehler or Tina Fey would meet with some random guy who has some service calling them up...","comments":[{"id":10847941,"level":5,"user":"JabavuAdams","time":1452046425,"time_ago":"2 minutes ago","content":"<p>Except it&#x27;s probably not some random guy, right? What if it was Elon Musk, or Bill Gates, or Christopher Nolan?","comments":[]},{"id":10847252,"level":5,"user":"tempestn","time":1452038965,"time_ago":"2 hours ago","content":"<p>They wouldn&#x27;t necessarily have to.  I&#x27;m sure there are events they attend that a sufficiently wealthy person could get a ticket or invite to.  Then it would just be a matter of introducing yourself.","comments":[]},{"id":10847208,"level":5,"user":"jmtulloss","time":1452038466,"time_ago":"2 hours ago","content":"<p>It probably wasn&#x27;t a random guy.","comments":[]}]}]}]},{"id":10846923,"level":2,"user":"Albright","time":1452035853,"time_ago":"3 hours ago","content":"<p>How much would I have to pay you guys to keep Tina Fey and Amy Poehler the hell away from me?","comments":[]}]}]},{"id":10846807,"level":0,"user":"pmichaud","time":1452034902,"time_ago":"3 hours ago","content":"<p>I&#x27;m deeply skeptical of this. It would be worth $100&#x2F;hr to hand off highly complex task like planning a wedding (from their copy), but it&#x27;s impossible--there is way too much interaction and iteration necessary on tasks like that.<p>For things you can realistically text to have done, the task has be crystal clear, and basically atomic. If I&#x27;ve already done the work of making it crystal clear and atomic, then it&#x27;s not worth $100&#x2F;hr anymore, because it&#x27;s just rote busy work at that point.","comments":[]},{"id":10847099,"level":0,"user":"SwellJoe","time":1452037372,"time_ago":"3 hours ago","content":"<p>I predict a few things for the future of this service (and this kind of service):<p>1. A lot of frustration from customers and a lot of churn. An effective personal assistant, or office manager, or whatever, effectively begins to read the mind of their employer. Lack of face-to-face, and what I imagine will be a lot of assistant churn, will result in very poor &quot;mind reading&quot; abilities. Cost of training a new assistant is much higher than actually having one, at least for folks who utilize their services a lot.<p>2. A race to the bottom on price, exacerbating the problem of assistant churn. $100&#x2F;hr leaves a lot of room at the bottom, but it&#x27;ll drop to the point where people in the US aren&#x27;t willing to do the job of magic assistant.<p>3. $0 is the cost of Siri, Google Now, and Alexa. They truly suck right now, for almost everything except taking the place of a keyboard, but will get better. There&#x27;s a limit to what &quot;virtual&quot; assistants can do for you; at some point you need a meat robot to go physically do stuff for you, if you want assistance beyond what technology can do.<p>Not to trash talk the idea or the company, at all. I haven&#x27;t tried it. I can&#x27;t think of anything it could do for me that I wouldn&#x27;t rather hire an actual assistant for. At $100, you can get several hours of real human time, in your local market. Someone you can meet, and develop a rapport with. I&#x27;m ordinarily not on the side of the fence that insists that the personal touch is important (I don&#x27;t like car dealers and want them to disappear, I don&#x27;t like sales people at any store and generally want them to disappear, etc. because in general, they know less than me about what I&#x27;m shopping for and just serve to annoy me and occasionally lie to me to try to manipulate my decision). But, in this case, there is real value in a real live human having access to your daily life or work so they can be most productive about helping you get shit done.","comments":[{"id":10847249,"level":1,"time":1452038911,"time_ago":"2 hours ago","content":"[deleted]","deleted":true,"comments":[]}]},{"id":10847733,"level":0,"user":"jayzalowitz","time":1452043801,"time_ago":"an hour ago","content":"<p>I recently thought of a better way to do this with a quasi supervised ML approach... I think this pricepoint is finally a good reason to do so.","comments":[]},{"id":10846660,"level":0,"user":"petke","time":1452033604,"time_ago":"4 hours ago","content":"<p>I thought this was about <a href=\"http:&#x2F;&#x2F;www.imagemagick.org&#x2F;Magick++&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;www.imagemagick.org&#x2F;Magick++&#x2F;</a>","comments":[{"id":10847861,"level":1,"time":1452045236,"time_ago":"22 minutes ago","content":"[deleted]","deleted":true,"comments":[]}]},{"id":10847669,"level":0,"user":"1812Overture","time":1452043047,"time_ago":"an hour ago","content":"<p>&quot;Magic+! I need the schematics of this building sent to my phone. And hack a satellite with infrared imaging so I can see where the terrorists are.&quot; - Jack Bauer","comments":[]},{"id":10847556,"level":0,"user":"billiam","time":1452042133,"time_ago":"an hour ago","content":"<p>Looks to me like someone read this undergraduate econ lesson from earlier today:<p><a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=10839116\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=10839116</a>","comments":[]},{"id":10847430,"level":0,"time":1452041208,"time_ago":"an hour ago","content":"[deleted]","deleted":true,"comments":[]},{"id":10847660,"level":0,"time":1452042979,"time_ago":"an hour ago","content":"[deleted]","deleted":true,"comments":[]},{"id":10846637,"level":0,"user":"cballard","time":1452033446,"time_ago":"4 hours ago","content":"<p>Is this a parody?","comments":[{"id":10846692,"level":1,"user":"minimaxir","time":1452033817,"time_ago":"4 hours ago","content":"<p>It should be noted that Magic was rumored to have raised $12M: <a href=\"http:&#x2F;&#x2F;techcrunch.com&#x2F;2015&#x2F;03&#x2F;26&#x2F;sources-magic-is-raising-12m-from-sequoia-at-a-40m-valuation&#x2F;\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2015&#x2F;03&#x2F;26&#x2F;sources-magic-is-raising-12...</a>","comments":[]},{"id":10846676,"level":1,"user":"arcatek","time":1452033702,"time_ago":"4 hours ago","content":"<p>No, Magic has already been discussed before[1]. It seems they are moving from a percentage pricing (Magic) to a per-time pricing (Magic+).<p>[1] <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=9087819\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=9087819</a>","comments":[{"id":10847078,"level":2,"user":"cballard","time":1452037183,"time_ago":"3 hours ago","content":"<p>Ah, the copy (&quot;Magician&quot;, somehow they&#x27;re going to conjure up Tina Fey for $100?) made me think it was a joke.","comments":[]}]},{"id":10846655,"level":1,"time":1452033585,"time_ago":"4 hours ago","content":"[deleted]","deleted":true,"comments":[]},{"id":10846657,"level":1,"time":1452033587,"time_ago":"4 hours ago","content":"[deleted]","deleted":true,"dead":true,"comments":[]},{"id":10846658,"level":1,"user":"archimedespi","time":1452033589,"time_ago":"4 hours ago","content":"<p>I don&#x27;t think it is.","comments":[]}]},{"id":10847903,"level":0,"user":"dinkumthinkum","time":1452045880,"time_ago":"11 minutes ago","content":"<p>It seems like an interesting way to fiendishly separate foolish people from their money.","comments":[]},{"id":10847070,"level":0,"user":"hackuser","time":1452037097,"time_ago":"3 hours ago","content":"<p>I&#x27;d love to know how they manage to scale such high quality service. They say they use &quot;top-tier executive assistants and concierges&quot;, but it&#x27;s hard to scale high-quality employees.<p>How does it differ from other concierge services, such as the one connected to American Express cards? What have others typically done well and poorly, and how does Magic+ overcome the limitations?","comments":[]},{"id":10847262,"level":0,"time":1452039130,"time_ago":"2 hours ago","content":"[deleted]","deleted":true,"comments":[]},{"id":10847150,"level":0,"user":"slmyers","time":1452037855,"time_ago":"2 hours ago","content":"<p>The landing page seems like a joke or a scam. I was honestly confused as to whether this was a legitimate service.","comments":[]},{"id":10846839,"level":0,"user":"smegel","time":1452035097,"time_ago":"3 hours ago","content":"<p>Out of my world, but I could see why the super-rich might like something like this. But I guess they have their own personal assistants for this stuff anyway.","comments":[{"id":10846869,"level":1,"user":"peteretep","time":1452035322,"time_ago":"3 hours ago","content":"<p>I&#x27;m far from super rich, but I make a small multiple of most senior dev salaries, and I could see this being useful","comments":[{"id":10846988,"level":2,"user":"rootedbox","time":1452036346,"time_ago":"3 hours ago","content":"<p>If you make 3x of senior dev salary in the SF then you are in the 1%. So i&#x27;d probably consider you super rich.","comments":[{"id":10847181,"level":3,"user":"tempestn","time":1452038212,"time_ago":"2 hours ago","content":"<p>To me, 1% is rich, but not &quot;super rich&quot;.  The 1% net worth cutoff in the US is somewhere in the single-digit millions.  I&#x27;d say &quot;super rich&quot; starts around a 9 figure net worth (hundreds of millions).  That&#x27;s more like the 0.01%.","comments":[]},{"id":10847332,"level":3,"user":"peteretep","time":1452040039,"time_ago":"2 hours ago","content":"<p>$400k household income puts someone in the US top 1%. I don&#x27;t think that fits any common definition of super-rich in the US.","comments":[{"id":10847678,"level":4,"user":"duderific","time":1452043152,"time_ago":"an hour ago","content":"<p>I&#x27;d say that depends what part of the US you&#x27;re in.","comments":[]}]}]}]}]},{"id":10847530,"level":0,"user":"mastazi","time":1452041956,"time_ago":"an hour ago","content":"<p>Are you guys able to read comfortably those tiny SMS screenshots? I was hoping I could click and zoom but nope...","comments":[]},{"id":10847337,"level":0,"user":"gcr","time":1452040132,"time_ago":"2 hours ago","content":"<p>&quot;I need the following hash reversed: abcd....&quot;","comments":[{"id":10847423,"level":1,"user":"fitzwatermellow","time":1452041171,"time_ago":"an hour ago","content":"<p>From the F.A.Q:<p>Q: What kinds of things can I use Magic+ for?<p>Anything you want. As long as it’s not illegal. Seriously.<p>&quot;I need you guys to unscramble this omelette by 5pm...&quot;<p>Kidding, and violating laws of nature aside, am rooting for the Magic+ team. Good luck!","comments":[]}]},{"id":10846727,"level":0,"user":"S4M","time":1452034293,"time_ago":"3 hours ago","content":"<p>&gt; Q: What about the purchases that I make through Magic+?<p>&gt; There is no markup on the purchases you make through Magic+. We find you the best deals that we can on every purchase, and we negotiate strongly with vendors. Often you will save more money using Magic+ than if you had done things yourself.<p>... I see a conflict of interest there.","comments":[{"id":10846933,"level":1,"user":"ethbro","time":1452035894,"time_ago":"3 hours ago","content":"<p>Granted, but they&#x27;re also making $100&#x2F;hr to fulfill your request. Sure, people are greedy, but I feel like you could staff some pretty honest, capable, and reliable dispatchers at $33&#x2F;hr (using a standard 3x billing vs salary multiplier).","comments":[]}]},{"id":10847557,"level":0,"user":"mdevere","time":1452042140,"time_ago":"an hour ago","content":"<p>This honestly looks awesome and easily worth the money.","comments":[{"id":10847661,"level":1,"user":"mdevere","time":1452042980,"time_ago":"an hour ago","content":"<p>And the proposition makes way way way more sense than the vanilla Magic.","comments":[{"id":10847688,"level":2,"user":"mdevere","time":1452043291,"time_ago":"an hour ago","content":"<p>And, might I add, that this business appears to be a net job creator... jobs funded by the 1%.","comments":[]}]}]},{"id":10847291,"level":0,"user":"whalesalad","time":1452039440,"time_ago":"2 hours ago","content":"<p>The examples are a little outlandish. Maybe some more realistic ones?","comments":[]},{"id":10846625,"level":0,"user":"w1ntermute","time":1452033368,"time_ago":"4 hours ago","content":"<p>Isn&#x27;t this just an overpriced Zirtual?<p><a href=\"https:&#x2F;&#x2F;www.zirtual.com&#x2F;plans-pricing\" rel=\"nofollow\">https:&#x2F;&#x2F;www.zirtual.com&#x2F;plans-pricing</a>","comments":[{"id":10846690,"level":1,"user":"pbreit","time":1452033805,"time_ago":"4 hours ago","content":"<p>No. It&#x27;s not even that similar. Zirtual is virtual&#x2F;remote. Magic is physical&#x2F;local.","comments":[]}]},{"id":10846718,"level":0,"user":"Animats","time":1452034193,"time_ago":"3 hours ago","content":"<p>This, of course, comes from Heinlein&#x27;s &quot;We Also Walk Dogs&quot;. Does Magic+ have anyone as good as Grace Cormet?","comments":[{"id":10846920,"level":1,"time":1452035800,"time_ago":"3 hours ago","content":"[deleted]","deleted":true,"comments":[]}]},{"id":10847077,"level":0,"user":"aresant","time":1452037174,"time_ago":"3 hours ago","content":"<p>First, did anybody else miss that what&#x27;s linked here is the &quot;+&quot; version, at $100&#x2F;hr?<p>The original &quot;pay per use&quot; service is still offered at <a href=\"https:&#x2F;&#x2F;getmagicnow.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;getmagicnow.com&#x2F;</a>","comments":[]},{"id":10847051,"level":0,"time":1452036867,"time_ago":"3 hours ago","content":"[deleted]","deleted":true,"comments":[]},{"id":10847690,"level":0,"time":1452043323,"time_ago":"an hour ago","content":"[deleted]","deleted":true,"comments":[]},{"id":10847229,"level":0,"user":"jkrejci","time":1452038676,"time_ago":"2 hours ago","content":"<p>This literally is why San Francisco has such a huge class divide. Congrats!","dead":true,"comments":[]},{"id":10847906,"level":0,"user":"eruannon","time":1452045892,"time_ago":"11 minutes ago","content":"<p>Wow, these guys are desperate for a pivot after getting torpedoed by Facebook M, huh?","dead":true,"comments":[]},{"id":10847674,"level":0,"user":"irascible","time":1452043115,"time_ago":"an hour ago","content":"<p>Can magic+ have someone gild my butthole while I snort lines of crushed modafinil from the belly of a vietnamese teenage hooker? Preferably while I&#x27;m in my corner office at my SF crowd funded startup disrupting the sustainable grass fed cheese supply chain?","dead":true,"comments":[]},{"id":10846699,"level":0,"user":"such_a_casual","time":1452033981,"time_ago":"3 hours ago","content":"<p>&gt; Our unique combination of humans and software<p>Oh god, I can&#x27;t stop laughing.","comments":[]},{"id":10846818,"level":0,"user":"supernintendo","time":1452034973,"time_ago":"3 hours ago","content":"<p>Rich people shit.","comments":[]},{"id":10847587,"level":0,"user":"voynich61","time":1452042360,"time_ago":"an hour ago","content":"<p>FUCK CAPITALISM GODDAMN","comments":[]},{"id":10846801,"level":0,"user":"sergiotapia","time":1452034871,"time_ago":"3 hours ago","content":"<p>This sounds utterly insane, yet so amazing.<p>“Find someone to train me like Jason Bourne.” Hahaha.","comments":[]},{"id":10846682,"level":0,"user":"archimedespi","time":1452033747,"time_ago":"4 hours ago","content":"<p>Really, really freaky. Especially all the copy about how <i>&quot;you can trust us&quot;</i>.","comments":[{"id":10846719,"level":1,"user":"ethbro","time":1452034199,"time_ago":"3 hours ago","content":"<p>How is this that different that Google Now? Except there are actually people (at least some of the time) at the other end, rather than massive amounts of logged data and code?","comments":[{"id":10846762,"level":2,"user":"oxryly1","time":1452034632,"time_ago":"3 hours ago","content":"<p>Google exists and has a reputation.","comments":[]},{"id":10846766,"level":2,"user":"BookmarkSaver","time":1452034646,"time_ago":"3 hours ago","content":"<p>...because you are paying them? Quite a bit? If you are paying $100&#x2F;hr for something, it is probably pretty important. I really don&#x27;t see the comparison to Google Now at all.","comments":[{"id":10846870,"level":3,"user":"ethbro","time":1452035331,"time_ago":"3 hours ago","content":"<p>My comment was in reply to the original &quot;you can trust us&quot; bent. Money paid is kind of immaterial to trust.<p>Well, other than as an inversely related quantity. I&#x27;d probably be more likely to trust someone I was paying $100&#x2F;hr.","comments":[]}]}]}]},{"id":10847035,"level":0,"user":"shaftway","time":1452036744,"time_ago":"3 hours ago","content":"<p>Really tempted to make an account just to request some inane stuff.","comments":[]},{"id":10846862,"level":0,"user":"PaulHoule","time":1452035271,"time_ago":"3 hours ago","content":"<p>It reminds me of the old Heinlein story &quot;We also walk dogs.&quot;<p>The $100&#x2F;hr rate bugs me a little.  Some people&#x27;s time is worth more than that and other is less.","comments":[]},{"id":10846729,"level":0,"user":"soared","time":1452034300,"time_ago":"3 hours ago","content":"<p>Based on their web design I doubt their ability to complete any simple task.","comments":[]}],"comments_count":229}